## data Analysis: files, stats, groups

In [2]:
import numpy as np
import pandas as pd

In [32]:
# we may load external data
df = pd.read_csv('data/salaries.csv') # also Excel, json, xml etc.
df.head(12)
df.describe() # ignore NaN

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [26]:
df.columns
df.size
df.sum()
df.max()
df['salary'].mean()

108023.78205128205

#### grouping and Aggregating Data

In [40]:
df_rank = df.groupby(['rank'])
df_rank
df_rank.count()

           discipline  phd  service  sex  salary
rank
AssocProf          13   13       13   13      13
AsstProf           19   19       19   19      19
Prof               46   46       46   46      46

In [56]:
# we may use groups to analyse our data
df_n = df.groupby(['sex','salary'])
df_n.max().head(40) # careful - there may be a large quantity of data
df_years = df.groupby('rank')
df_years[['service']].mean()

             service
rank
AssocProf  11.307692
AsstProf    2.210526
Prof       21.413043

In [ ]:
# mini-challenge
# show the mean salary for each rank grouped by male/female